
--1
ALTER TABLE [Награды_спортсмен] 
	DROP CONSTRAINT [DF__Награды_с__Разме__1D6B1596]  

ALTER TABLE Награды_спортсмен 
	ADD CONSTRAINT [DF__Награды_с__Разме__1D6B1596] DEFAULT (1001) FOR Размер_выплаты

INSERT INTO Награды_спортсмен(Спортсмен_ид,Награда_ид,Дата_привоения,Турнир_ид) VALUES (
dbo.id_of_sportsman('Любич', 'Виталий', 'Олегович', '01-12-1993' ) , 1,'11-12-2017',1)

select * from Награды_спортсмен

--2
ALTER TABLE [Спортсмен] ADD Улица_дом_корпус VARCHAR (200)
SELECT * FROM [Спортсмен]

UPDATE [Спортсмен] SET Улица_дом_корпус = (Улица.Название+', дом '+ [Спортсмен].дом+', корпус '+ [Спортсмен].корпус) 
from [Спортсмен] inner join [Улица] on [Улица].[Улица_ид] = Спортсмен.Улица_ид 

--название улицы может поменяться

SELECT * FROM [Спортсмен]



--Улица дом корпус
--изменить dafault